In [12]:
import numpy as np
import pandas as pd
from sklearn.ensemble import RandomForestClassifier

In [ ]:
# dataset: https://www.kaggle.com/c/titanic/data
train_df = pd.read_csv("train.csv")
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
test_df = pd.read_csv("test.csv")
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
women = train_df.loc[train_df.Sex == 'female']["Survived"]
rate_women = sum(women)/len(women)
print(f"percentage of women that survived: {rate_women}")

percentage of women that survived: 0.7420382165605095

In [7]:
men = train_df.loc[train_df.Sex == "male"]["Survived"] 
rate_men = sum(men)/len(men)
print(f"percentage of men that survived {rate_men}")

percentage of men that survived 0.18890814558058924

In [19]:
y = train_df["Survived"]
features =  ["Pclass", "Sex", "SibSp", "Parch"]
x = pd.get_dummies(train_df[features])
x_test  = pd.get_dummies(test_df[features])
model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)
model.fit(x,y)
predictions = model.predict(x_test)
output = pd.DataFrame({'PassengerId': test_df.PassengerId, 'survived': predictions})
output.to_csv('submission.csv', index =False)
print("your submission was succesfully saved!")

your submission was succesfully saved!

In [20]:
pd.read_csv("submission.csv")

     PassengerId  survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]